ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>PDRAMSCR0</name>
                    <description>SRAM Power Domain Standby Control Register 0</description>
                    <addressOffset>0x140</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x7fff</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>RKEEP0</name>
                            <description>Unnecessary Circuit Retention</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of unnecessary circuit are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of unnecessary circuit are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RKEEP1</name>
                            <description>Unnecessary Circuit Retention</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of unnecessary circuit are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of unnecessary circuit are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RKEEP2</name>
                            <description>RAM Retention</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RKEEP3</name>
                            <description>RAM Retention</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RKEEP4</name>
                            <description>RAM Retention</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RKEEP5</name>
                            <description>RAM Retention</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RKEEP6</name>
                            <description>RAM Retention</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the Software Standby mode, the contents of the target RAM are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDRAMSCR1</name>
                    <description>SRAM Power Domain Standby Control Register 1</description>
                    <addressOffset>0x142</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>RKEEP0</name>
                            <description>RAM Retention</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When entering the CPU Deep Sleep and Software Standby mode, the contents of the target RAM are not kept.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When entering the CPU Deep Sleep and Software Standby mode, the contents of the target RAM are kept.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBRSABAR</name>
                    <description>VBATT Backup Register Security Attribute Boundary Address Register</description>
                    <addressOffset>0x3B0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xffe0</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SABA</name>
                            <description>Boundary address between secure and non-secure</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBRPABARS</name>
                    <description>VBATT Backup Register Privilege Attribute Boundary Address Register for Secure Region</description>
                    <addressOffset>0x3B4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PABAS</name>
                            <description>Boundary address between privileged and unprivileged.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
