ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x02</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RTCCR%s</name>
                    <description>Time Capture Control Register %s</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x48</resetMask>
                    <fields>
                        <field>
                            <name>TCCT</name>
                            <description>Time Capture Control</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Do not detect events</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Detect rising edge</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Detect falling edge</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Detect both edges</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCST</name>
                            <description>Time Capture Status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No event detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Event detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCNF</name>
                            <description>Time Capture Noise Filter Control</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Turn noise filter off</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Setting prohibited</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Turn noise filter on (count source)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Turn noise filter on (count source by divided by 32)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCEN</name>
                            <description>Time Capture Event Input Pin Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the RTCICn pin as the time capture event input pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the RTCICn pin as the time capture event input pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT0CP%s</name>
                    <description>BCNT0 Capture Register %s</description>
                    <addressOffset>0x52</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RSECCP%s</name>
                    <description>Second Capture Register %s</description>
                    <alternateRegister>BCNT0CP%s</alternateRegister>
                    <addressOffset>0x52</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>SEC1</name>
                            <description>1-Second Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEC10</name>
                            <description>10-Second Capture</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT1CP%s</name>
                    <description>BCNT1 Capture Register %s</description>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMINCP%s</name>
                    <description>Minute Capture Register %s</description>
                    <alternateRegister>BCNT1CP%s</alternateRegister>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>MIN1</name>
                            <description>1-Minute Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MIN10</name>
                            <description>10-Minute Capture</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT2CP%s</name>
                    <description>BCNT2 Capture Register %s</description>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RHRCP%s</name>
                    <description>Hour Capture Register %s</description>
                    <alternateRegister>BCNT2CP%s</alternateRegister>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>HR1</name>
                            <description>1-Hour Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HR10</name>
                            <description>10-Hour Capture</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>PM</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>AM</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>PM</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT3CP%s</name>
                    <description>BCNT3 Capture Register %s</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RDAYCP%s</name>
                    <description>Date Capture Register %s</description>
                    <alternateRegister>BCNT3CP%s</alternateRegister>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATE1</name>
                            <description>1-Day Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATE10</name>
                            <description>10-Day Capture</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMONCP%s</name>
                    <description>Month Capture Register %s</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xe0</resetMask>
                    <fields>
                        <field>
                            <name>MON1</name>
                            <description>1-Month Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MON10</name>
                            <description>10-Month Capture</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
