ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>GAMB_LUT7</name>
                    <description>Gamma B Correction Block Table Setting Register 7</description>
                    <addressOffset>0x1360</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN13</name>
                            <description>Gain Value of Area 13</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN12</name>
                            <description>Gain Value of Area 12</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMB_LUT8</name>
                    <description>Gamma B Correction Block Table Setting Register 8</description>
                    <addressOffset>0x1364</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN15</name>
                            <description>Gain Value of Area 15</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN14</name>
                            <description>Gain Value of Area 14</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMB_AREA1</name>
                    <description>Gamma B Correction Block Area Setting Register 1</description>
                    <addressOffset>0x1368</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH03</name>
                            <description>Start Threshold of Area 3</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH02</name>
                            <description>Start Threshold of Area 2</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH01</name>
                            <description>Start Threshold of Area 1</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMB_AREA2</name>
                    <description>Gamma B Correction Block Area Setting Register 2</description>
                    <addressOffset>0x136C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH06</name>
                            <description>Start Threshold of Area 6</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH05</name>
                            <description>Start Threshold of Area 5</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH04</name>
                            <description>Start Threshold of Area 4</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMB_AREA3</name>
                    <description>Gamma B Correction Block Area Setting Register 3</description>
                    <addressOffset>0x1370</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH09</name>
                            <description>Start Threshold of Area 9</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH08</name>
                            <description>Start Threshold of Area 8</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH07</name>
                            <description>Start Threshold of Area 7</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMB_AREA4</name>
                    <description>Gamma B Correction Block Area Setting Register 4</description>
                    <addressOffset>0x1374</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH12</name>
                            <description>Start Threshold of Area 12</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH11</name>
                            <description>Start Threshold of Area 11</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH10</name>
                            <description>Start Threshold of Area 10</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMB_AREA5</name>
                    <description>Gamma B Correction Block Area Setting Register 5</description>
                    <addressOffset>0x1378</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH15</name>
                            <description>Start Threshold of Area 15</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH14</name>
                            <description>Start Threshold of Area 14</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH13</name>
                            <description>Start Threshold of Area 13</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LATCH</name>
                    <description>Gamma R Register Update Control Register</description>
                    <addressOffset>0x1380</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>VEN</name>
                            <description>Control of Gamma Correction × Module Register Value Reflection to Internal Operations</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable reflection of register values to internal operations on assertion of vertical synchronization signal (VS)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable reflection of register values to internal operations on assertion of the vertical synchronization signal (VS)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT1</name>
                    <description>Gamma R Correction Block Table Setting Register 1</description>
                    <addressOffset>0x1388</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN01</name>
                            <description>Gain Value of Area 1</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN00</name>
                            <description>Gain Value of Area 0</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT2</name>
                    <description>Gamma R Correction Block Table Setting Register 2</description>
                    <addressOffset>0x138C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN03</name>
                            <description>Gain Value of Area 3</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN02</name>
                            <description>Gain Value of Area 2</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT3</name>
                    <description>Gamma R Correction Block Table Setting Register 3</description>
                    <addressOffset>0x1390</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN05</name>
                            <description>Gain Value of Area 5</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN04</name>
                            <description>Gain Value of Area 4</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT4</name>
                    <description>Gamma R Correction Block Table Setting Register 4</description>
                    <addressOffset>0x1394</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN07</name>
                            <description>Gain Value of Area 7</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN06</name>
                            <description>Gain Value of Area 6</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT5</name>
                    <description>Gamma R Correction Block Table Setting Register 5</description>
                    <addressOffset>0x1398</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN09</name>
                            <description>Gain Value of Area 9</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN08</name>
                            <description>Gain Value of Area 8</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT6</name>
                    <description>Gamma R Correction Block Table Setting Register 6</description>
                    <addressOffset>0x139C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN11</name>
                            <description>Gain Value of Area 11</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN10</name>
                            <description>Gain Value of Area 10</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT7</name>
                    <description>Gamma R Correction Block Table Setting Register 7</description>
                    <addressOffset>0x13A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN13</name>
                            <description>Gain Value of Area 13</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN12</name>
                            <description>Gain Value of Area 12</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_LUT8</name>
                    <description>Gamma R Correction Block Table Setting Register 8</description>
                    <addressOffset>0x13A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAIN15</name>
                            <description>Gain Value of Area 15</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN14</name>
                            <description>Gain Value of Area 14</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_AREA1</name>
                    <description>Gamma R Correction Block Area Setting Register 1</description>
                    <addressOffset>0x13A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH03</name>
                            <description>Start Threshold of Area 3</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH02</name>
                            <description>Start Threshold of Area 2</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH01</name>
                            <description>Start Threshold of Area 1</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_AREA2</name>
                    <description>Gamma R Correction Block Area Setting Register 2</description>
                    <addressOffset>0x13AC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH06</name>
                            <description>Start Threshold of Area 6</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH05</name>
                            <description>Start Threshold of Area 5</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH04</name>
                            <description>Start Threshold of Area 4</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
