ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>GAMR_AREA3</name>
                    <description>Gamma R Correction Block Area Setting Register 3</description>
                    <addressOffset>0x13B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH09</name>
                            <description>Start Threshold of Area 9</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH08</name>
                            <description>Start Threshold of Area 8</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH07</name>
                            <description>Start Threshold of Area 7</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_AREA4</name>
                    <description>Gamma R Correction Block Area Setting Register 4</description>
                    <addressOffset>0x13B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH12</name>
                            <description>Start Threshold of Area 12</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH11</name>
                            <description>Start Threshold of Area 11</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH10</name>
                            <description>Start Threshold of Area 10</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAMR_AREA5</name>
                    <description>Gamma R Correction Block Area Setting Register 5</description>
                    <addressOffset>0x13B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TH15</name>
                            <description>Start Threshold of Area 15</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH14</name>
                            <description>Start Threshold of Area 14</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH13</name>
                            <description>Start Threshold of Area 13</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_VLATCH</name>
                    <description>Output Control Block Register Update Control Register</description>
                    <addressOffset>0x13C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>VEN</name>
                            <description>Control of Output Control Module Register Value Reflection to Internal Operations</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable reflection of register values to internal operations on assertion of vertical synchronization signal (VS)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable reflection of register values to internal operations on assertion of vertical synchronization signal (VS).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_SET</name>
                    <description>Output Control Block Output Interface Register</description>
                    <addressOffset>0x13C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PHASE</name>
                            <description>Data Output Delay Control in Serial RGB Format</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>0 cycle</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1 cycle</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>2 cycles</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>3 cycles</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRSEL</name>
                            <description>Scan Direction Select of Serial RGB Format</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Forward scan</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reverse scan</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FRQSEL</name>
                            <description>Clock Frequency Division Control</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>No frequency division, parallel RGB</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Setting prohibited</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Quarter frequency (serial RGB)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FORMAT</name>
                            <description>Output Format Select</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>RGB888 — select RGB888 as dither output format</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>RGB666 — select RGB666 as dither output format</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>RGB565 — select RGB565 as dither output format</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Serial RGB — select RGB888 as dither output format. Select dither output format in OUT_PDTHA.FORM[1:0] </description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWAPON</name>
                            <description>Pixel Order Control</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RGB order</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>BGR order</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ENDIANON</name>
                            <description>Bit Endian Control</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Descending order (little endian)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Ascending order (big endian)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_BRIGHT1</name>
                    <description>Output Control Block Brightness Correction Register 1</description>
                    <addressOffset>0x13C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BRTG</name>
                            <description>Brightness Adjustment of G Signal</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_BRIGHT2</name>
                    <description>Output Control Block Brightness Correction Register 2</description>
                    <addressOffset>0x13CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BRTR</name>
                            <description>Brightness Adjustment of R Signal</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRTB</name>
                            <description>Brightness Adjustment of B Signal</description>
                            <lsb>16</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_CONTRAST</name>
                    <description>Output Control Block Contrast Correction Register</description>
                    <addressOffset>0x13D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CONTR</name>
                            <description>Contrast Adjustment of R Signal</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CONTB</name>
                            <description>Contrast Adjustment of B Signal</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CONTG</name>
                            <description>Contrast Adjustment of G Signal</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_PDTHA</name>
                    <description>Output Control Block Panel Dither Correction Register</description>
                    <addressOffset>0x13D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PD</name>
                            <description>Pattern Value (D) of 2×2 Pattern Dither</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PC</name>
                            <description>Pattern Value (C) of 2×2 Pattern Dither</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>Pattern Value (B) of 2×2 Pattern Dither</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA</name>
                            <description>Pattern Value (A) of 2×2 Pattern Dither</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORM</name>
                            <description>Output Format Select</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>RGB888; select RGB888 or serial RGB as output interface format</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>RGB666; select RGB666 as output interface format</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>RGB565; select RGB565 as output interface format</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited Select output interface format in OUT_SET.FORMAT[1:0]. </description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>Operation Mode</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Truncate</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Round-off</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>2×2 pattern dither</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited </description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
