ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>WUPEN1</name>
                    <description>Wake Up interrupt enable register 1</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>COMPHS0WUPEN</name>
                            <description>Comparator-HS0 Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by Comparator-HS0 interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 Underflow interrupt is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ULP0UWUPEN</name>
                            <description>ULPT0 Underflow Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 Underflow interrupt is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ULP0AWUPEN</name>
                            <description>ULPT0 Compare Match A Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 Compare match A interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 Compare match A interrupt is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ULP0BWUPEN</name>
                            <description>ULPT0 Compare Match B Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 Compare match B interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT0 Compare match B interrupt is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ULP1UWUPEN</name>
                            <description>ULPT1 Underflow Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT1 Underflow interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT1 Underflow interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ULP1AWUPEN</name>
                            <description>ULPT1 Compare Match A Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT1 Compare match A interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT1 Compare match A interrupt is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ULP1BWUPEN</name>
                            <description>ULPT1 Compare Match B Interrupt Deep Sleep/Software Standby Mode returns Enable bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT1 Compare match B interrupt is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Deep Sleep/Software Standby returns by ULPT1 Compare match B interrupt is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>96</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-95</dimIndex>
                    <name>IELSR%s</name>
                    <description>ICU Event Link Setting Register %s</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IELS</name>
                            <description>ICU Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>Disable interrupts to the associated NVIC or DTC module</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Event signal number to be linked. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IR</name>
                            <description>Interrupt Status Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No interrupt request generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An interrupt request is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DTCE</name>
                            <description>DTC Activation Enable</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DTC activation is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DTC activation is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
