ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>LPCTL1</name>
                    <description>OSPI Link Pattern Control Register 1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PATREQ</name>
                            <description>Pattern request</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>No request </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Request Reset pattern</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Request CS only pattern</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSSEL</name>
                            <description>Chip select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>slave0 (CS0)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>slave1 (CS1)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTREP</name>
                            <description>Reset pattern repeat</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>4 times (Specified on Reset Signaling Protocol)</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>5 times</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>6 times</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>7 times</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTWID</name>
                            <description>Reset pattern width</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSTSU</name>
                            <description>Reset pattern data output setup time</description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LIOCTL</name>
                    <description>OSPI Link I/O Control Register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00030003</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>WPCS1</name>
                            <description>WP drive for slave1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Drive Low level</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Drive High level</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCS0</name>
                            <description>Reset drive</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Drive Low level</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Drive High level</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL0CS%s</name>
                    <description>OSPI Command Calibration Control Register 0 CSn</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1f000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CAEN</name>
                            <description>Automatic Calibration Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable automatic calibration</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable automatic calibration</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CANOWR</name>
                            <description>Calibration no write mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Calibration sequence with write command</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Calibration sequence without write command</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CAITV</name>
                            <description>Calibration interval</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CASFTSTA</name>
                            <description>Calibration OM_DQS shift start value</description>
                            <lsb>16</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CASFTEND</name>
                            <description>Calibration OM_DQS shift end value</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL1CS%s</name>
                    <description>OSPI Command Calibration Control Register 1 CSn</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CACMDSIZE</name>
                            <description>Command Size</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>0 bytes (No command phase) </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1 byte</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>2 bytes</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CAADDSIZE</name>
                            <description>Address size</description>
                            <lsb>2</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>0 bytes (No address phase) </description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>1 byte</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>2 bytes</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>3 bytes</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>4 bytes</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CADATASIZE</name>
                            <description>Write/Read Data Size</description>
                            <lsb>5</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAWRLATE</name>
                            <description>Write Latency cycle</description>
                            <lsb>16</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CARDLATE</name>
                            <description>Read Latency cycle</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL2CS%s</name>
                    <description>OSPI Command Calibration Control Register 2 CSn</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CAWRCMD</name>
                            <description>Calibration pattern write command</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CARDCMD</name>
                            <description>Calibration pattern read command</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL3CS%s</name>
                    <description>OSPI Command Calibration Control Register 3 CSn</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CAADD</name>
                            <description>Calibration pattern address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL4CS%s</name>
                    <description>OSPI Command Calibration Control Register 4 CSn</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CADATA</name>
                            <description>Calibration pattern data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL5CS%s</name>
                    <description>OSPI Command Calibration Control Register 5 CSn</description>
                    <addressOffset>0x144</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CADATA</name>
                            <description>Calibration pattern data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL6CS%s</name>
                    <description>OSPI Command Calibration Control Register 6 CSn</description>
                    <addressOffset>0x148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CADATA</name>
                            <description>Calibration pattern data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x020</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CCCTL7CS%s</name>
                    <description>OSPI Command Calibration Control Register 7 CSn</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CADATA</name>
                            <description>Calibration pattern data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
