ra-rs/ra/svd/vendor/R7FA8E2AF.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GLCDC_NS</name>
            <description>Graphics LCD Controller</description>
            <baseAddress>0x50342000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4124</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1100</offset>
                <size>636</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1380</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1388</offset>
                <size>52</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x13C0</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x13E4</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1404</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1440</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR1_CLUT0%s</name>
                    <description>Color Palette</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha blending value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR1_CLUT1%s</name>
                    <description>Color Palette</description>
                    <addressOffset>0x0400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha blending value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR2_CLUT0%s</name>
                    <description>Color Palette</description>
                    <addressOffset>0x0800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha blending value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR2_CLUT1%s</name>
                    <description>Color Palette</description>
                    <addressOffset>0x0C00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha blending value of color palette n plane for graphics m plane. Unsigned 8-bit integer.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_EN</name>
                    <description>Background Plane Setting Operation Control Register</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>Background Plane Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable background plane operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable background plane operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VEN</name>
                            <description>Control of GLCDC Internal Register Value Reflection to Internal Operations</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable GLCDC register values from being reflected in internal operations at start of screen generation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable GLCDC register values to be reflected in internal operations at start of screen generation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>Software Reset Control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Place entire module in software reset state</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Release entire module from software reset state</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_PERI</name>
                    <description>Background Plane Setting Free-Running Period Register</description>
                    <addressOffset>0x1004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00170017</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FH</name>
                            <description>Background Plane Horizontal Synchronization Signal Period</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x017</name>
                                    <description>24 cycles (pixels)</description>
                                    <value>0x017</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3FF</name>
                                    <description>1024 cycles (pixels)</description>
                                    <value>0x3ff</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FV</name>
                            <description>Background Plane Vertical Synchronization Signal Period</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x013</name>
                                    <description>20 lines</description>
                                    <value>0x013</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3FF</name>
                                    <description>1024 lines</description>
                                    <value>0x3ff</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_SYNC</name>
                    <description>Background Plane Setting Synchronization Position Register</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010001</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HP</name>
                            <description>Background Plane Horizontal Synchronization Signal Assertion Position</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Setting prohibited</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>HPth cycle (pixel)</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VP</name>
                            <description>Background Plane Vertical Synchronization Assertion Position</description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Setting prohibited</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>VPth line</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_VSIZE</name>
                    <description>Background Plane Setting Full Image Vertical Size Register</description>
                    <addressOffset>0x100C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00070010</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>VW</name>
                            <description>Background Plane Vertical Valid Pixel Width</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VP</name>
                            <description>Background Plane Vertical Valid Pixel Start Position</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_HSIZE</name>
                    <description>Background Plane Setting Full Image Horizontal Size Register</description>
                    <addressOffset>0x1010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060010</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HW</name>
                            <description>Background Plane Horizontal Valid Pixel Width</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HP</name>
                            <description>Background Plane Horizontal Valid Pixel Start Position</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_BGC</name>
                    <description>Background Plane Setting Background Color Register</description>
                    <addressOffset>0x1014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>Background Plane Valid Pixel Area B Value</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>Background Plane Valid Pixel Area G Value</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>Background Plane Valid Pixel Area R Value</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
