ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>BG_MON</name>
                    <description>Background Plane Setting Status Monitor Register</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>Background Plane Operation Monitor</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operation is stopped</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Operation is in progress</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VEN</name>
                            <description>Entire Module Internal Operation Reflection Control Signal Monitor</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Signal for controlling reflection of the register values to internal operations on assertion of vertical synchronization signal is negated</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Signal for controlling reflection of the register values to internal operations on assertion of vertical synchronization signal is asserted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>Entire Module SW Reset State Monitor</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Entire module is in software reset state</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Entire module is released from software reset state</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_VEN</name>
                    <description>Graphics %s Register Update Control Register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PVEN</name>
                            <description>This bit is cleared to 0 by an internal source.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable reflection of register values to internal operations on assertion of vertical synchronization signal (VS)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable reflection of register values to internal operations on assertion of the vertical synchronization signal (VS)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_FLMRD</name>
                    <description>Graphics %s Frame Buffer Read Control Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RENB</name>
                            <description>Graphics Data Read Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable reading</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable reading</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_FLM1</name>
                    <description>Graphics %s Frame Buffer Control Register 1</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BSTMD</name>
                            <description>Burst Transfer Control for Graphics Data Access</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>16-beat increment burst transfer (64-byte boundary)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_FLM2</name>
                    <description>Graphics %s Frame Buffer Control Register 2</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BASE</name>
                            <description>Base Address for Accessing Graphics Data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_FLM3</name>
                    <description>Graphics %s Frame Buffer Control Register 3</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LNOFF</name>
                            <description>Macro Line Offset Address for Accessing Graphics Data</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_FLM5</name>
                    <description>Graphics %s Frame Buffer Control Register 5</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000f0000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATANUM</name>
                            <description>Number of Data Transfer Times Per Line for Accessing Graphics Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LNNUM</name>
                            <description>Number of Lines Per Frame for Accessing Graphics Data</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_FLM6</name>
                    <description>Graphics %s Frame Buffer Control Register 6</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FORMAT</name>
                            <description>Data Format for Accessing Graphics Data</description>
                            <lsb>28</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>RGB565 (16 bits/pixel)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>RGB888 (32 bits/pixel, 8 bits on the MSB side are invalid)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>ARGB1555 (16 bits/pixel, 1 bit of A is LUT data)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>ARGB4444 (16 bits/pixel)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>ARGB8888 (32 bits/pixel)</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>CLUT8 (8 bits/pixel)</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>CLUT4 (4 bits/pixel)</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>CLUT1 (1 bit/pixel)</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_AB1</name>
                    <description>Graphics %s Alpha Blending Control Register 1</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DISPSEL</name>
                            <description>Graphics Display Plane Control</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Background color display (value set in the GRn_BASE register)</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Lower-layer graphics display</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Current graphics display</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Blended display of lower-layer graphics (input image from the previous stage) and current graphics (data read from the GLCDC0 and GLCDC1 bus)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GRCDISPON</name>
                            <description>Graphics Image Area Border Display Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Turn display off</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Turn display on</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ARCDISPON</name>
                            <description>Image Area Border Display Control for Rectangular Area Alpha Blending</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Turn display off</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Turn display on</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ARCON</name>
                            <description>Rectangular Area Alpha Blending Control</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Turn blending off</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Turn blending on</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>GR%s_AB2</name>
                    <description>Graphics %s Alpha Blending Control Register 2</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060010</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GRCVW</name>
                            <description>Vertical Width of Graphics Image Area</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GRCVS</name>
                            <description>Vertical Start Position of Graphics Image Area</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
