ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>ORIGIN</name>
                    <description>Framebuffer Base Address Register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ORIGIN</name>
                            <description>Address of the First Pixel in Framebuffer</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUSTART</name>
                    <description>U Limiter Start Value Register</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LUSTART</name>
                            <description>U Limiter Start Value</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUXADD</name>
                    <description>U Limiter X-Axis Increment Register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LUXADD</name>
                            <description>U Limiter X-Axis Increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUYADD</name>
                    <description>U Limiter Y-Axis Increment Register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LUYADD</name>
                            <description>U Limiter Y-Axis Increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVSTARTI</name>
                    <description>V Limiter Start Value Integer Part Register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LVSTARTI</name>
                            <description>V Limiter Start Value Integer Part</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVSTARTF</name>
                    <description>V Limiter Start Value Fractional Part Register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LVSTARTF</name>
                            <description>V Limiter Start Value Fractional Part</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVXADDI</name>
                    <description>V Limiter X-Axis Increment Integer Part Register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LVXADDI</name>
                            <description>V Limiter X-Axis Increment Integer Part</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVYADDI</name>
                    <description>V Limiter Y-Axis Increment Integer Part Register</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LVYADDI</name>
                            <description>V Limiter Y-Axis Increment Integer Part</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVYXADDF</name>
                    <description>V Limiter Increment Fractional Parts Register</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LVXADDF</name>
                            <description>V Limiter X-Axis Increment Fractional Part</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LVYADDF</name>
                            <description>V Limiter Y-Axis Increment Fractional Part</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXPITCH</name>
                    <description>Texels Per Texture Line Register</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TEXPITCH</name>
                            <description>Texels Per Texture Line</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXMASK</name>
                    <description>Texture Size or Texture Address Mask Register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TEXUMASK</name>
                            <description>U Mask in Texture Mode</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TEXVMASK</name>
                            <description>V Mask in Texture Mode</description>
                            <lsb>11</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXORIGIN</name>
                    <description>Texture Base Address Register</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TEXORIGIN</name>
                            <description>Texture Base Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQCTL</name>
                    <description>Interrupt Control Register</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ENUMIRQEN</name>
                            <description>ENUMIRQ Interrupt Mask Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable (mask) ENUMIRQ enumeration interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable (unmask) ENUMIRQ enumeration interrupt.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DLISTIRQEN</name>
                            <description>DLISTIRQ Interrupt Mask Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable (mask) DLISTIRQ display list interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable (unmask) DLISTIRQ display list interrupt.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ENUMIRQCLR</name>
                            <description>Clear ENUMIRQ</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not clear ENUMIRQ enumeration interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clear ENUMIRQ enumeration interrupt.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DLISTIRQCLR</name>
                            <description>Clear DLISTIRQ</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not clear DLISTIRQ display list interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clear DLISTIRQ display list interrupt.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSIRQEN</name>
                            <description>BUSIRQ Interrupt Mask Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable (mask) BUSIRQ bus error interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable (unmask) BUSIRQ bus error interrupt.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSIRQCLR</name>
                            <description>Clear BUSIRQ</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not clear BUSIRQ bus error interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clear BUSIRQ bus error interrupt.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CACHECTL</name>
                    <description>Cache Control Register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CENABLEFX</name>
                            <description>Framebuffer Cache Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the framebuffer cache</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the framebuffer cache.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFLUSHFX</name>
                            <description>Flush Framebuffer Cache</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not flush the framebuffer cache</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flush the framebuffer cache.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CENABLETX</name>
                            <description>Texture Cache Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable the texture cache</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable the texture cache.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFLUSHTX</name>
                            <description>Flush Texture Cache</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not flush the texture cache</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flush the texture cache.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLISTSTART</name>
                    <description>Display List Start Address Register</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DLISTSTART</name>
                            <description>Display List Start Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFCOUNT1</name>
                    <description>Performance Counter 1</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PERFCOUNT</name>
                            <description>Performance Counter k Value</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
