ra-rs/ra/svd/vendor/R7FA8E2AF.svd
                <register>
                    <name>MSR</name>
                    <description>Manchester Status Register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PFER</name>
                            <description>Preface Error Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No preface error detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Preface error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYER</name>
                            <description>SYNC Error Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No receive SYNC error detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Receive SYNC error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SBER</name>
                            <description>Start Bit Error Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No start bit error detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start bit error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MER</name>
                            <description>Manchester Error Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No Manchester error occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Manchester error has occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSYNC</name>
                            <description>Receive SYNC Data Bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The received start bit is DATA SYNC</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The received start bit is COMMAND SYNC</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XSR0</name>
                    <description>Simple LIN Status Register 0</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SFSF</name>
                            <description>Start Frame Status Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Start Frame detection disabled or Start Frame detection complete</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Before Start Frame detection or during detection</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXDSF</name>
                            <description>RXDn Input Status Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RXDn input to SCI is enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RXDn input to SCI is disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BFOF</name>
                            <description>Break Field Output Completion Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Break Field is being output or is not being output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Completed BF output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BCDF</name>
                            <description>Bus Conflict Detection Flag</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No bus collision detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Detected a bus collision</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BFDF</name>
                            <description>Break Field Detection Flag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Break Field is not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Break Field is detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CF0MF</name>
                            <description>Control Field 0 Compare Match Flag</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Control Field 0 received data does not match the setting data</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Control Field 0 received data matches the setting data</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CF1MF</name>
                            <description>Control Field 1 Compare Match Flag</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Control Field 1 received data does not match the setting data</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Control Field 1 received data matches the setting data</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIBDF</name>
                            <description>Priority Interrupt Bit Detection Flag</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priority interrupt bit is not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Priority interrupt bit is detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COF</name>
                            <description>Counter Overflow Flag</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Break Field detection counter has not overflowed</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Break Field detection counter overflowed</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AEDF</name>
                            <description>Active Edge Detection Flag</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No valid edge detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Detected a valid edge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CF0RD</name>
                            <description>Control Field 0 received data</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CF1RD</name>
                            <description>Control Field 1 received data</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XSR1</name>
                    <description>Simple LIN Status Register 1</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TCNT</name>
                            <description>Timer Count Capture Value</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCLR</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ERSC</name>
                            <description>ERS Clear Bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DCMFC</name>
                            <description>DCMF Clear Bit</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DPERC</name>
                            <description>DPER Clear Bit</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DFERC</name>
                            <description>DFER Clear Bit</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ORERC</name>
                            <description>ORER Clear Bit</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MFFC</name>
                            <description>MFF Clear Bit</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>PER Clear Bit</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FERC</name>
                            <description>FER Clear Bit</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TDREC</name>
                            <description>TDRE Clear Bit</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RDRFC</name>
                            <description>RDRF Clear Bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICFCLR</name>
                    <description>Simple IIC Flag Clear Register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IICSTIFC</name>
                            <description>IICSTIF Clear Bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FFCLR</name>
                    <description>FIFO Flag Clear Register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DRC</name>
                            <description>DR Clear Bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
