ra-rs/ra/svd/vendor/R7FA8E2AF.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="ECCMB0_NS">
            <name>ECCMB1_NS</name>
            <description>Error Correction Circuit for MBRAMn</description>
            <baseAddress>0x5036F300</baseAddress>
        </peripheral>
        <peripheral>
            <name>CANFD0_NS</name>
            <description>CANFD Module 0</description>
            <baseAddress>0x50380000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>34</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x38</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3C</offset>
                <size>120</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB8</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD8</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>268</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>256</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x520</offset>
                <size>604</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x920</offset>
                <size>680</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD20</offset>
                <size>680</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1124</offset>
                <size>676</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1524</offset>
                <size>676</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CFDC0NCFG</name>
                    <description>Nominal Bitrate Configuration Register</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>NBRP</name>
                            <description>Channel Nominal Baud Rate Prescaler</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NSJW</name>
                            <description>Resynchronization Jump Width</description>
                            <lsb>10</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NTSEG1</name>
                            <description>Timing Segment 1</description>
                            <lsb>17</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NTSEG2</name>
                            <description>Timing Segment 2</description>
                            <lsb>25</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDC0CTR</name>
                    <description>Control Register</description>
                    <addressOffset>0x0004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000005</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CHMDC</name>
                            <description>Channel Mode Control</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Channel operation mode request</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Channel reset request</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Channel halt request</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Keep current value</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSLPR</name>
                            <description>Channel Sleep Request</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Channel sleep request disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Channel sleep request enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTBO</name>
                            <description>Return from Bus-Off</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Channel is not forced to return from bus-off</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Channel is forced to return from bus-off</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BEIE</name>
                            <description>Bus Error Interrupt Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus error interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus error interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EWIE</name>
                            <description>Error Warning Interrupt Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Error warning interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Error warning interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EPIE</name>
                            <description>Error Passive Interrupt Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Error passive interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Error passive interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BOEIE</name>
                            <description>Bus-Off Entry Interrupt Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus-off entry interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus-off entry interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BORIE</name>
                            <description>Bus-Off Recovery Interrupt Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus-off recovery interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus-off recovery interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OLIE</name>
                            <description>Overload Interrupt Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Overload interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Overload interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BLIE</name>
                            <description>Bus Lock Interrupt Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus lock interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus lock interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ALIE</name>
                            <description>Arbitration Lost Interrupt Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Arbitration lost interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Arbitration lost interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAIE</name>
                            <description>Transmission Abort Interrupt Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX abort interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX abort interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EOCOIE</name>
                            <description>Error Occurrence Counter Overflow Interrupt Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Error occurrence counter overflow interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Error occurrence counter overflow interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SOCOIE</name>
                            <description>Successful Occurrence Counter Overflow Interrupt Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Successful occurrence counter overflow interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Successful occurrence counter overflow interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TDCVFIE</name>
                            <description>Transceiver Delay Compensation Violation Interrupt Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Transceiver delay compensation violation interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transceiver delay compensation violation interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BOM</name>
                            <description>Channel Bus-Off Mode</description>
                            <lsb>21</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Normal mode (comply with ISO 11898-1)</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Entry to Halt mode automatically at bus-off start</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Entry to Halt mode automatically at bus-off end</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Entry to Halt mode (during bus-off recovery period) by software</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERRD</name>
                            <description>Channel Error Display</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Only the first set of error codes displayed</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
